Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox.ImageListComboBoxMouseWheel Event
 The ImageListComboBoxMouseWheel event is triggered just after the mouse wheel has been activated on top of the combo box.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event MouseEventHandler ImageListComboBoxMouseWheel
Public Event ImageListComboBoxMouseWheel As MouseEventHandler
Value
Type: System.Windows.Forms.MouseEventHandler
See Also
Reference
ImageListComboBox Class
Tekla.Structures.Dialog.UIControls Namespace